{
    "subject": "Tareas Semana 2",
    "content": "<h4> Tareas: </h4> <ul> <li> Tarea Personal: Realizar el diagrama de flujo del algoritmo de la actividad de la vida cotidiana realizado en la semana 1. </li>  <li> Tarea Personal: Realizar el diagrama de flujo del algoritmo de una problemática industrial realizado en la semana 1. </li> <li> Tarea en equipo ( Proceso modular ): Realizar el diagrana de flujo del algoritmo del proyecto final. </li> <li> Tarea en equipo ( Proceso detallado ): Expandir a detalle el diagrana de flujo del algoritmo del proyecto final, es decir, agregar condicionales, ciclos, impresiones de información para el usuario, etcétera, según lo requiera el algoritmo. </li> </ul> <h4> Instrucciones para cada alumno: </h4> <ul> <li> Tarea Personal: Tanto el algoritmo no gráfico como el diagrama de flujo de la  actividad de la vida cotidiana escribirlos/dibujarlos digitalmente (por ejemplo en word), guardar el documento en formato pdf y nombrarlo siguiendo la regla (evitar espacios en el nombre): cveMateria-primerNombre-matrícula-algoritmo1-cotidiano.pdf --> ejemplo: 75004-Carlos-1030034-algoritmo1-cotidiano.pdf </li>  <li> Tarea Personal: Tanto el algoritmo no gráfico como el diagrama de flujo de una problemática industrial escribirlos/dibujarlos digitalmente (por ejemplo en word), guardar el documento en formato pdf y nombrarlo siguiendo la regla (evitar espacios en el nombre): cveMateria-primerNombre-matrícula-algoritmo2-industrial.pdf --> ejemplo: 75004-Carlos-1030034-algoritmo2-industrial.pdf </li>  <li> Enviar los dos archivos (PDF) anteriores al profesor: Cada alumno debe enviar un correo electrónico al profesor ctovarg@upv.edu.mx, utilizando el asunto: Algoritmos Personales y adjuntar sus dos documentos pdf. </li> <li> Evitar enviar documentos de Microsoft Office (Word, PowerPoint, Excel). </li> <li> Enviar los documentos antes de las 23:59:59 del día viernes 13 de septiembre de 2024. </li> </ul> <h4> Instrucciones para los Equipos: </h4> <ul> <li> Tarea en equipo ( Proceso modular) : Tanto el algoritmo no gráfico como el diagrama de flujo del proyecto escribirlos/dibujarlos digitalmente (por ejemplo en word), guardar el documento en formato pdf y nombrarlo siguiendo la regla (evitar espacios en el nombre): cveMateria-equipo-nombreProyecto-modular.pdf --> ejemplo: 75004-Equipo0-controlRemotoDeRobot-modular.pdf </li> <li> Tarea en equipo ( Proceso detallado) : Tanto el algoritmo no gráfico como el diagrama de flujo del proyecto escribirlos/dibujarlos digitalmente (por ejemplo en word), guardar el documento en formato pdf y nombrarlo siguiendo la regla (evitar espacios en el nombre): cveMateria-equipo-nombreProyecto-detallado.pdf --> ejemplo: 75004-Equipo0-controlRemotoDeRobot-detallado.pdf </li> <li> Enviar los dos archivos (PDF) de proyecto: Cada líder de equipo enviará los dos documentos anteriores (proceso modular y proceso detallado)  al profesor ctovarg@upv.edu.mx, utilizando el asunto: Proyecto de Equipo cve-materia equipo (ejemplo Proyecto de equipo 75004 Equipo 0) y adjuntar sus dos documentos. </li> <li> Evitar enviar documentos de Microsoft Office (Word, PowerPoint, Excel). </li> <li> Enviar los documentos antes de las 23:59:59 del día viernes 13 de septiembre de 2024. </li> </ul>"
}